import { v4 as uuidv4 } from "uuid";
import illustratorEssential from "../../../assets/img/bgCourseCards/illustratorEssential.jpg";

const illustratorEssentialProgram = {
  programHeader: {
    title: "Illustrator",
    tag: "C нуля",
    heroSubtitle:
      "Курс Adobe illustrator, позволит вам быстро освоить инструменты создания иллюстраций, логотипов, иконок и векторов!",
    type: "Курс",
    bgImg: illustratorEssential,
    difficulty: 1,
  },

  program: [
    {
      id: uuidv4(),
      title: "Подготовка",
      info: "4 лекции • 16м",
      lessons: [
        { lesson: "Скачиваем материалы! Как проходить курс.", time: "02:18" },
        { lesson: "Где приобрести лицензионный иллюстратор", time: "02:15" },
        { lesson: "Настройка программы Adobe Illustrator", time: "11:19" },
        { lesson: "Оставайтесь со мной на связи", time: "00:11" },
      ],
    },
    {
      id: uuidv4(),
      title: "Рисование в Adobe Illustrator",
      info: "17 лекций • 2ч 43м",
      lessons: [
        { lesson: "Рисование фигурами и линиями", time: "15:15" },
        { lesson: "Дорисовываем первую иллюстрацию", time: "25:15" },
        {
          lesson: "Создание теней на иллюстрации с помощью инструмента 'Создание фигур'",
          time: "12:09",
        },
        { lesson: "Возможные проблемы", time: "04:32" },
        { lesson: "Как сохранить работу", time: "02:23" },
        { lesson: "Практика. Нарисуйте иллюстрацию", time: "02:58" },
        { lesson: "Пример преподавателя. Рисуем пингвина", time: "14:18" },
        {
          lesson: "Создаем невозможную фигуру используя инструмент 'Создание фигур'",
          time: "06:42",
        },
        { lesson: "Создаем иллюстрацию используя инструмент 'Создание фигур'", time: "10:01" },
        { lesson: "Создаем иллюстрации с помощью инструмента 'Кривизна'", time: "05:46" },
        {
          lesson: "Используем инструмент 'перо' для детальной отрисовки иллюстраций",
          time: "06:04",
        },
        { lesson: "Рисуем иллюстрацию инструментом 'перо'", time: "08:33" },
        { lesson: "Как изменить размер холста", time: "03:48" },
        { lesson: "Используем 'карандаш' для рисования", time: "13:23" },
        { lesson: "Используем 'кисть' для рисования", time: "05:38" },
        { lesson: "Как использовать инструмент 'ширина'", time: "03:47" },
        { lesson: "Правильная работа со слоями. Новая иллюстрация", time: "22:25" },
      ],
    },
    {
      id: uuidv4(),
      title: "Ресурсы",
      info: "3 лекции • 24м",
      lessons: [
        { lesson: "Как устанавливать кисти в Illustrator", time: "06:42" },
        { lesson: "Стоковые площадки", time: "06:28" },
        { lesson: "Что такое графический планшет", time: "10:52" },
      ],
    },
    {
      id: uuidv4(),
      title: "Текст и шрифт",
      info: "3 лекции • 33м",
      lessons: [
        { lesson: "Как создавать текст в Adobe Illustrator", time: "14:57" },
        { lesson: "Как устанавливать шрифты в Illustrator", time: "10:27" },
        { lesson: "Как писать текст на линии", time: "07:46" },
      ],
    },
    {
      id: uuidv4(),
      title: "Цвет в Adobe Illustrator",
      info: "5 лекций • 29м",
      lessons: [
        { lesson: "Как подбирать цвета", time: "06:39" },
        { lesson: "Как добавлять цвета в Illustrator", time: "05:30" },
        { lesson: "Как создавать градиент", time: "07:02" },
        { lesson: "Как использовать произвольный градиент", time: "04:34" },
        { lesson: "RGB VS CMYK", time: "05:37" },
      ],
    },
    {
      id: uuidv4(),
      title: "Технические вещи",
      info: "5 лекций • 44м",
      lessons: [
        { lesson: "Как работать с библиотеками", time: "08:21" },
        { lesson: "Что такое трассировка изображений", time: "06:28" },
        { lesson: "Какие бывают форматы изображений", time: "08:46" },
        { lesson: "В чем измеряется качество изображений", time: "16:36" },
        { lesson: "Про приложение Capture", time: "03:35" },
      ],
    },
    {
      id: uuidv4(),
      title: "Использование масок в Adobe Illustrator",
      info: "3 лекции • 22м",
      lessons: [
        { lesson: "Как создавать обтравочную маску", time: "06:39" },
        { lesson: "Как использовать составной контур", time: "14:33" },
        { lesson: "Создаем эффект 'Paper cut'", time: "01:11" },
      ],
    },
    {
      id: uuidv4(),
      title: "Эффекты",
      info: "4 лекции • 30м",
      lessons: [
        { lesson: "Инструменты деформации", time: "05:28" },
        { lesson: "Эффекты деформирования", time: "14:01" },
        { lesson: "Трансформирование объектов", time: "05:44" },
        { lesson: "Как создавать паттерны", time: "04:50" },
      ],
    },
    {
      id: uuidv4(),
      title: "Бонус. Дополнительные проекты",
      info: "4 лекции • 48м",
      lessons: [
        { lesson: "Создаем лого - 1", time: "06:13" },
        { lesson: "Создаем лого - 2", time: "07:34" },
        { lesson: "Как создавать интернет баннеры", time: "30:31" },
        { lesson: "Где искать вдохновение", time: "03:46" },
      ],
    },
    {
      id: uuidv4(),
      title: "Экспорт из Adobe Illustrator",
      info: "3 лекции • 17м",
      lessons: [
        { lesson: "Подготовка для печати", time: "06:46" },
        { lesson: "Подготовка к экспорту в цифровой вид", time: "07:51" },
        { lesson: "Что такое преобразование в кривые", time: "02:42" },
      ],
    },
    {
      id: uuidv4(),
      title: "Что дальше?",
      info: "1 лекция • 1м",
      lessons: [{ lesson: "До новых встреч!", time: "01:12" }],
    },
  ],
};

export default illustratorEssentialProgram;
